emacs/configuration.el

(use-package minions
  :config
  (setq minions-mode-line-lighter ""
        minions-mode-line-delimiters '("" . ""))
  (minions-mode 1))

(setq ring-bell-function 'ignore)

(global-hl-line-mode)

(use-package diff-hl
  :config
  (add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
  (add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode))

(use-package ag
  :commands (ag ag-project)
  :config
  (setq ag-executable "/usr/local/bin/ag")
  (setq ag-highlight-search t)
  (setq ag-reuse-buffers t)
  (setq ag-reuse-window t))

(use-package company
  :hook (add-hook 'after-init-hook 'global-company-mode)
  :general
  (general-def "M-/" 'company-complete-common))

(use-package dumb-jump
  :config
  (setq dumb-jump-selector 'ivy)
  :general
  (tyrant-def
    "."  'dumb-jump-go))

(use-package flycheck)

;; (use-package projectile
;; :ensure t
;; :defer 1
;; :config
;; (projectile-mode)
;; (setq projectile-project-search-path '("~/Sites/"))
;; (setq projectile-enable-caching t)
;; (setq projectile-mode-line
;; 	'(:eval
;; 	(format " Proj[%s]"
;; 		(projectile-project-name)))))

(use-package projectile
	:config
	(setq projectile-completion-system 'ivy)
	(setq projectile-switch-project-action 'projectile-dired)
	(setq projectile-require-project-root nil)
  (projectile-global-mode)
	:general
	('normal '(override-global-map ag-mode-map rspec-mode-map)
			"C-p" 'projectile-find-file)
	(tyrant-def
		","  'projectile-ag))

(use-package undo-tree)

(setq-default tab-width 2)

(use-package subword
	:config (global-subword-mode 1))
;; (superword-mode 1)

(setq compilation-scroll-output t)

(use-package css-mode
  :config
  (setq css-indent-offset 2))

(use-package scss-mode
  :config
  (setq scss-compile-at-save nil))

(use-package less-css-mode)

(use-package haml-mode
      :config
(add-hook 'haml-mode-hook 'rspec-mode))

(use-package slim-mode
      :config
(add-hook 'slim-mode-hook 'rspec-mode))

(use-package coffee-mode)

(setq js-indent-level 2)

(add-hook 'coffee-mode-hook
          (lambda ()
            (yas-minor-mode 1)
            (setq coffee-tab-width 2)))

(use-package paredit)

(use-package rainbow-delimiters)

(setq lispy-mode-hooks
      '(clojure-mode-hook
        emacs-lisp-mode-hook
        lisp-mode-hook
        scheme-mode-hook))

(dolist (hook lispy-mode-hooks)
  (add-hook hook (lambda ()
                   (setq show-paren-style 'expression)
                   (paredit-mode)
                   (rainbow-delimiters-mode))))

(use-package eldoc
  :config
  (add-hook 'emacs-lisp-mode-hook 'eldoc-mode))

(use-package flycheck-package)

(eval-after-load 'flycheck
  '(flycheck-package-setup))

(setq oookli/ruby-version "2.5.3")

(use-package chruby
  :config
  (chruby oookli/ruby-version))

(oookli/append-to-path (format "~/.gem/ruby/%s/bin" oookli/ruby-version))

(use-package rspec-mode)

(setq-default flycheck-disabled-checkers '(ruby-reek))

(setq ruby-align-to-stmt-keywords '(def if))

(use-package yard-mode)

(use-package ruby-end)

(use-package projectile-rails
  :config
  (projectile-rails-global-mode))

(add-hook 'ruby-mode-hook
          (lambda ()
            (setq ruby-insert-encoding-magic-comment nil)
            (yas-minor-mode)
            (rspec-mode)
            (yard-mode)
            (flycheck-mode)
            (local-set-key "\r" 'newline-and-indent)
            (setq rspec-command-options "--color --order random")
            (chruby-use-corresponding)))

(oookli/add-auto-mode
 'ruby-mode
 "\\Gemfile$"
 "\\.rake$"
 "\\.gemspec$"
 "\\Guardfile$"
 "\\Rakefile$"
 "\\Vagrantfile$"
 "\\Vagrantfile.local$")

(add-hook 'rspec-compilation-mode-hook
          (lambda ()
            (make-local-variable 'compilation-scroll-output)
            (setq compilation-scroll-output 'first-error)))

(add-hook 'web-mode-hook
          (lambda ()
            (rainbow-mode)
            (rspec-mode)
            (setq web-mode-markup-indent-offset 2)))

(oookli/add-auto-mode
 'web-mode
 "\\.erb$"
 "\\.html$"
 "\\.php$"
 "\\.rhtml$")

(use-package yaml-mode
      :config
	      (add-hook 'yaml-mode-hook 'rspec-mode))
