emacs/configuration.org
** Configure =ivy= and =counsel=

I use =ivy= and =counsel= as my completion framework.

This configuration:

- Uses =counsel-M-x= for command completion,
- Replaces =isearch= with =swiper=,
- Uses =smex= to maintain history,
- Enables fuzzy matching everywhere except swiper (where it's thoroughly
  unhelpful), and
- Includes recent files in the switch buffer.

#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :bind
    ("M-x" . 'counsel-M-x)
    ("C-s" . 'swiper)

    :config
    (use-package flx)
    (use-package smex)

    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq ivy-count-format "(%d/%d) ")
    (setq ivy-initial-inputs-alist nil)
    (setq ivy-re-builders-alist
          '((swiper . ivy--regex-plus)
            (t . ivy--regex-fuzzy)))
		:general
		(general-def :keymaps '(ivy-occur-mode-map ivy-occur-grep-mode-map ivy-minibuffer-map)
		"C-j" 'ivy-next-line
		"C-k" 'ivy-previous-line)
		(tyrant-def "\\" 'ivy-switch-buffer))
#+END_SRC
* Mass editing of =grep= results
I like the idea of mass editing =grep= results the same way I can edit filenames
in =dired=. These keybindings allow me to use =C-x C-q= to start editing =grep=
results and =C-c C-c= to stop, just like in =dired=.

#+BEGIN_SRC emacs-lisp
	(use-package wgrep
	:config
	(wgrep-change-to-wgrep-mode))

	;; (eval-after-load 'grep
	;;   '(define-key grep-mode-map
	;;     (kbd "C-x C-q") 'wgrep-change-to-wgrep-mode))

	;; (eval-after-load 'wgrep
	;;   '(define-key grep-mode-map
	;;     (kbd "C-c C-c") 'wgrep-finish-edit))

	;; (setq wgrep-auto-save-buffer t)
#+END_SRC
* Terminal
I use =multi-term= to manage my shell sessions. It's bound to =C-c t=.

#+BEGIN_SRC emacs-lisp
	(use-package multi-term
	:ensure t
	:config
		(setq multi-term-program "/bin/zsh")
		;; (setq multi-term-program-switches "--login")
		(evil-set-initial-state 'term-mode 'emacs)
	:general
		(tyrant-def
				"t" 'multi-term))
#+END_SRC

I add a bunch of hooks to =term-mode=:

- I'd like links (URLs, etc) to be clickable.
- Yanking in =term-mode= doesn't quite work. The text from the paste appears in
  the buffer but isn't sent to the shell process. This correctly binds =C-y= and
  middle-click to yank the way we'd expect.
- I bind =M-o= to quickly change windows. I'd like that in terminals, too.
- I don't want to perform =yasnippet= expansion when tab-completing.

#+BEGIN_SRC emacs-lisp
  (defun oookli/term-paste (&optional string)
    (interactive)
    (process-send-string
     (get-buffer-process (current-buffer))
     (if string string (current-kill 0))))

  (add-hook 'term-mode-hook
            (lambda ()
              (goto-address-mode)
              (define-key term-raw-map (kbd "C-y") 'oookli/term-paste)
              (define-key term-raw-map (kbd "<mouse-2>") 'oookli/term-paste)
              (define-key term-raw-map (kbd "M-o") 'other-window)
              (setq yas-dont-activate t)))
#+END_SRC
* Set custom keybindings
Just a few handy functions.

#+BEGIN_SRC emacs-lisp
	;; (global-set-key (kbd "C-w") 'backward-kill-word)
	(global-set-key (kbd "M-o") 'other-window)
#+END_SRC

# Remap when working in terminal Emacs.

# #+BEGIN_SRC emacs-lisp
#   (define-key input-decode-map "\e[1;2A" [S-up])
# #+END_SRC
