emacs/configuration.el

(use-package counsel
  :bind
  ("M-x" . 'counsel-M-x)
  ("C-s" . 'swiper)

  :config
  (use-package flx)
  (use-package smex)

  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq ivy-initial-inputs-alist nil)
  (setq ivy-re-builders-alist
        '((swiper . ivy--regex-plus)
          (t . ivy--regex-fuzzy)))
	      :general
	      (general-def :keymaps '(ivy-occur-mode-map ivy-occur-grep-mode-map ivy-minibuffer-map)
	      "C-j" 'ivy-next-line
	      "C-k" 'ivy-previous-line)
	      (tyrant-def "\\" 'ivy-switch-buffer))

(use-package wgrep
:config
(wgrep-change-to-wgrep-mode))

;; (eval-after-load 'grep
;;   '(define-key grep-mode-map
;;     (kbd "C-x C-q") 'wgrep-change-to-wgrep-mode))

;; (eval-after-load 'wgrep
;;   '(define-key grep-mode-map
;;     (kbd "C-c C-c") 'wgrep-finish-edit))

;; (setq wgrep-auto-save-buffer t)

(use-package multi-term
:ensure t
:config
	(setq multi-term-program "/bin/zsh")
	;; (setq multi-term-program-switches "--login")
	(evil-set-initial-state 'term-mode 'emacs)
:general
	(tyrant-def
			"t" 'multi-term))

(defun oookli/term-paste (&optional string)
  (interactive)
  (process-send-string
   (get-buffer-process (current-buffer))
   (if string string (current-kill 0))))

(add-hook 'term-mode-hook
          (lambda ()
            (goto-address-mode)
            (define-key term-raw-map (kbd "C-y") 'oookli/term-paste)
            (define-key term-raw-map (kbd "<mouse-2>") 'oookli/term-paste)
            (define-key term-raw-map (kbd "M-o") 'other-window)
            (setq yas-dont-activate t)))

;; (global-set-key (kbd "C-w") 'backward-kill-word)
(global-set-key (kbd "M-o") 'other-window)
